
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>CMP设计思想 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="think.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    CMP设计思想
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="think.html">
            
                <a href="think.html">
            
                    
                    CMP使用手册
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="制作FTL模板.html">
            
                <a href="制作FTL模板.html">
            
                    
                    制作FTL模板
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="添加hover展示子组件.html">
            
                <a href="添加hover展示子组件.html">
            
                    
                    添加Hover展示子组件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="自定义hover样式.html">
            
                <a href="自定义hover样式.html">
            
                    
                    自定义Hover样式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="制作regular组件.html">
            
                <a href="制作regular组件.html">
            
                    
                    制作Regular组件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="为组件添加动画.html">
            
                <a href="为组件添加动画.html">
            
                    
                    为组件添加动画
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="制作复杂nejregular模块.html">
            
                <a href="制作复杂nejregular模块.html">
            
                    
                    制作复杂NEJ+Regular模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="制作cache驱动模块.html">
            
                <a href="制作cache驱动模块.html">
            
                    
                    制作Cache驱动模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="制作功能模块完整流程.html">
            
                <a href="制作功能模块完整流程.html">
            
                    
                    制作功能模块完整流程
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">高级</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    CMP制作动画
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="组件池的使用.html">
            
                <a href="组件池的使用.html">
            
                    
                    组件池的使用
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >CMP设计思想</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="cmp-&#x8BBE;&#x8BA1;&#x601D;&#x60F3;">CMP &#x8BBE;&#x8BA1;&#x601D;&#x60F3;</h1>
<p>&#x53BB;&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;&#x795E;&#x5668;&#x7684;&#x8BBE;&#x60F3;&#xFF0C;&#x5E7B;&#x60F3;&#x7740;&#x795E;&#x5668;&#x80FD;&#x5E2E;&#x6211;&#x4EEC;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B8C;&#x6210;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x65F6;&#x9694;&#x4E00;&#x5E74;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E0D;&#x65AD;&#x5730;&#x601D;&#x8003;&#x4E0E;&#x5B9E;&#x8DF5;&#xFF0C;&#x795E;&#x5668;&#x7EC8;&#x4E8E;&#x6765;&#x4E86;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5728;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#x7684;&#x529F;&#x80FD;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x5B8C;&#x5584;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x80FD;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x91CF;&#x4E86;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#x7684;&#x610F;&#x4E49;&#x91CD;&#x5927;&#xFF0C;&#x6709;&#x4E86;&#x795E;&#x5668;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x4F5C;&#x4E3A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x4F60;&#x4F1A;&#x7528;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x4E00;&#x79CD;&#x505A;&#x8BBE;&#x8BA1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5F00;&#x53D1;&#x7EC4;&#x4EF6;&#x3001;&#x6A21;&#x5757;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x7EBF;&#x3001;&#x4E1A;&#x52A1;&#x7EBF;&#x3002;
<img src="assets/intro.jpg" alt=""></p>
<ol>
<li><p>&#x5173;&#x4E8E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;
a. &#x89C6;&#x89C9;&#x7A3F;&#x4E00;&#x76F4;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x751F;&#x547D;&#x7EBF;&#xFF0C;&#x6BCF;&#x4E2A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x90FD;&#x60F3;&#x8981;&#x505A;&#x51FA;&#x7F8E;&#x89C2;&#x7684;&#x9875;&#x9762;&#x3001;&#x7EDA;&#x4E3D;&#x7684;&#x52A8;&#x753B;&#xFF0C;&#x4F18;&#x96C5;&#x7684;&#x5B9E;&#x73B0;&#x4EA4;&#x4E92;&#x903B;&#x8F91;&#x3002;&#x6BCF;&#x6B21;&#x82B1;&#x8D39;&#x5728;&#x4FEE;&#x6539;&#x89C6;&#x89C9;&#x4E0A;&#x9762;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x89C6;&#x89C9;&#x4FEE;&#x6539;&#x4E00;&#x70B9;&#xFF0C;&#x53C8;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x89C6;&#x89C9;&#x7A3F;&#x7684;&#x8FD8;&#x539F;&#x5EA6;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x6548;&#x679C;&#x603B;&#x662F;&#x4F1A;&#x6709;&#x5DEE;&#x522B;&#x3002;
b. &#x9875;&#x9762;&#x5E03;&#x5C40;&#x662F;&#x505A;&#x754C;&#x9762;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x800C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x559C;&#x597D;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x4E5F;&#x4E0D;&#x540C;&#x3002;&#x6709;&#x7684;&#x540C;&#x5B66;&#x559C;&#x6B22;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x5E03;&#x5C40;&#xFF0C;&#x6709;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4E60;&#x60EF;&#x7528;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x3002;&#x867D;&#x7136;&#x6700;&#x7EC8;&#x90FD;&#x80FD;&#x5B9E;&#x73B0;&#x9875;&#x9762;&#x5C55;&#x793A;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x4E0D;&#x7EDF;&#x4E00;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x4E0D;&#x592A;&#x89C4;&#x8303;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7A00;&#x5947;&#x53E4;&#x602A;&#x7684;&#x95EE;&#x9898;&#x3002;
c. &#x4EE3;&#x7801;&#x4E0D;&#x89C4;&#x8303;&#xFF0C;&#x5BB9;&#x6613;&#x72AF;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x3002;&#x4E0E;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#x76F8;&#x6BD4;&#xFF0C;&#x6211;&#x66F4;&#x76F8;&#x4FE1;&#x673A;&#x5668;&#x3002;&#x4EBA;&#x7C7B;&#x53D1;&#x660E;&#x5404;&#x79CD;&#x673A;&#x5668;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x673A;&#x68B0;&#x5F0F;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x90FD;&#x662F;&#x6309;&#x7167;&#x65E2;&#x5B9A;&#x7A0B;&#x5F0F;&#x6765;&#x8FD0;&#x4F5C;&#xFF0C;&#x6781;&#x5C11;&#x6216;&#x8005;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x7C7B;&#x4F3C;&#x62FC;&#x9519;&#x5355;&#x8BCD;&#x8FD9;&#x79CD;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x3002;
d. &#x867D;&#x7136;&#x8BF4;&#x524D;&#x7AEF;&#x95E8;&#x69DB;&#x5F88;&#x4F4E;&#xFF0C;&#x5B66;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5C31;&#x53EF;&#x4EE5;&#x52A8;&#x624B;&#x505A;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x9875;&#x9762;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x50CF;&#x8FD0;&#x8425;&#x6216;&#x8005;&#x4E00;&#x4E9B;&#x5B9E;&#x4E60;&#x751F;&#x6765;&#x8BF4;&#xFF0C;&#x8981;&#x5B66;&#x4E60;&#x4F01;&#x4E1A;&#x7EA7;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x6216;&#x8005;&#x4EA7;&#x54C1;&#x7EBF;&#x7684;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x6210;&#x672C;&#x90FD;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x5B66;&#x4E60;&#x5468;&#x671F;&#x957F;&#xFF0C;&#x96BE;&#x4EE5;&#x5FEB;&#x901F;&#x4E0A;&#x624B;&#x5199;&#x51FA;&#x5408;&#x4E4E;&#x89C4;&#x8303;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x811A;&#x624B;&#x67B6;&#x5DE5;&#x5177;&#x8F85;&#x52A9;&#x505A;&#x5F00;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x4E0A;&#x624B;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x66F4;&#x77ED;&#x3002;</p>
</li>
<li><p>&#x89E3;&#x51B3;&#x65B9;&#x6848; - &#x524D;&#x7AEF;&#x8F85;&#x52A9;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF08;&#x795E;&#x5668;&#xFF09;
a. &#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x5F88;&#x96BE;&#x6709;&#x4E07;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;
&#x7ECF;&#x8FC7;&#x5B9E;&#x8DF5;&#x4E0E;&#x6478;&#x7D22;&#xFF0C;&#x6211;&#x603B;&#x7ED3;&#x7684;&#x65B9;&#x6CD5;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#xFF1A;&#x6A21;&#x578B;&#x62BD;&#x8C61;&#x3002;&#x6240;&#x6709;&#x7684;&#x7A0B;&#x5E8F;&#x65E0;&#x975E;&#x662F;&#x6570;&#x636E;+&#x7B97;&#x6CD5;&#x7EC4;&#x6210;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9875;&#x9762;&#x6548;&#x679C;&#x4E0D;&#x80FD;&#x62BD;&#x8C61;&#x6210;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x5462;&#xFF1F;&#x4E8E;&#x662F;&#x6211;&#x5C31;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#x3002;
&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x62BD;&#x8C61;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5462;&#xFF1F;&#x5982;&#x4F55;&#x62BD;&#x8C61;&#x5462;&#xFF1F;
<img src="assets/intro1.png" alt="">
&#x7B80;&#x5355;&#x7684;&#x4EE5;&#x7F51;&#x6613;&#x65B0;&#x95FB;&#x9996;&#x9875;&#x4E3A;&#x4F8B;&#x5206;&#x6790;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C55;&#x793A;&#x578B;&#x9875;&#x9762;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x5143;&#x7D20;&#x662F; div span img ...&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5143;&#x7D20;&#x6709;&#x5404;&#x81EA;&#x7684;css&#x5C5E;&#x6027;&#xFF0C;&#x4E00;&#x4E9B;css&#x5C5E;&#x6027;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;css&#x5C5E;&#x6027;&#x662F;&#x7279;&#x6709;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x5C31;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x6837;&#x5F0F;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="assets/intro2.png" alt="">
&#x6709;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x4E0D;&#x591F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x6839;&#x636E;&#x6570;&#x636E;&#x6A21;&#x578B;&#x8BA1;&#x7B97;&#x51FA;&#x5143;&#x7D20;&#x5BF9;&#x5E94;&#x7684;&#x5C55;&#x793A;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5143;&#x7D20;&#x4E2D;&#x5B9E;&#x73B0;&#x6E32;&#x67D3;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x4E0D;&#x4F5C;&#x591A;&#x4ECB;&#x7ECD;&#xFF0C;&#x671F;&#x5F85;&#x795E;&#x5668;3&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p>
</li>
</ol>
<p>b.&#x5BF9;&#x4E8E;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x7684;&#x95EE;&#x9898;
&#x5176;&#x5B9E;&#x5F88;&#x65E9;&#x56FD;&#x5916;&#x5C31;&#x6709;&#x8BB8;&#x591A;&#x754C;&#x9762;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x7F51;&#x7AD9;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6DFB;&#x52A0;&#x6587;&#x672C;&#xFF0C;&#x62D6;&#x62FD;&#x4F4D;&#x7F6E;&#xFF0C;&#x4FEE;&#x6539;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x5C55;&#x793A;&#x754C;&#x9762;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x65E9;&#x5C31;&#x60F3;&#x505A;&#x8FD9;&#x79CD;&#x4E86;&#xFF0C;&#x4E00;&#x76F4;&#x62D6;&#x7740;&#xFF0C;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x505A;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x505A;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x6BCF;&#x6B21;&#x5199;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x771F;&#x7684;&#x5F88;&#x70E6;&#xFF0C;&#x7EC8;&#x4E8E;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x505A;&#x4E00;&#x4E2A;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x5668;&#x4E86;&#x3002;&#x4E4B;&#x524D;&#x770B;&#x8FC7;bootstrap&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x5668;layout&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x591F;&#x7075;&#x6D3B;&#xFF0C;&#x540E;&#x6765;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x4E0B;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x5668;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x9875;&#x9762;&#x5E03;&#x5C40;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x5462;&#xFF1F;&#x6709;&#x4EC0;&#x4E48;&#x89C4;&#x8303;&#x5316;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x61C2;&#x554A;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x6478;&#x7D22;&#x3002;
    &#x4E8E;&#x662F;&#x6211;&#x91C7;&#x7528;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x79CD;&#x5E03;&#x5C40;&#x6A21;&#x5F0F;&#xFF1A;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;+&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x3002;&#x539F;&#x7406;&#x5982;&#x4E0B;&#xFF1A;
<img src="assets/intro3.png" alt="">
&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x6700;&#x5916;&#x5C42;&#x7684;&#x5305;&#x88F9;&#x5143;&#x7D20;&#x91C7;&#x7528;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6A21;&#x5F0F;&#xFF0C;&#x5185;&#x90E8;&#x6240;&#x6709;&#x5B50;&#x5143;&#x7D20;&#x90FD;&#x91C7;&#x7528;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x6A21;&#x5F0F;&#x3002;&#x65E0;&#x8BBA;&#x591A;&#x590D;&#x6742;&#x7684;&#x9875;&#x9762;&#x5E03;&#x5C40;&#xFF0C;&#x53EA;&#x8981;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x5D4C;&#x5957;&#x7684;&#x65B9;&#x5F0F;&#x90FD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5927;&#x4E8B;&#x5316;&#x5C0F;&#xFF0C;&#x5C0F;&#x4E8B;&#x5316;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x5C42;&#x5D4C;&#x5957;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x6837;&#xFF1A;
<img src="assets/intro4.png" alt="">
&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5D4C;&#x5957;&#xFF1F;
&#x6211;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#xFF1A;&#x5B9E;&#x73B0;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x3002;
&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x7801;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6700;&#x9891;&#x7E41;&#x7684;&#x51FD;&#x6570;&#x65E0;&#x975E;&#x6709;&#x4E09;&#x79CD;&#xFF1A;if&#x51FD;&#x6570;&#xFF0C;for&#x5FAA;&#x73AF;&#x51FD;&#x6570;&#x548C;&#x6A21;&#x677F;&#x4E2D;&#x5E38;&#x7528;&#x7684;include&#x6216;&#x8005;import&#x51FD;&#x6570;&#x3002; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x53EA;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E09;&#x79CD;&#x51FD;&#x6570;&#x7684;&#x89E3;&#x6790;&#x6A21;&#x5F0F;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;80%&#x4EE5;&#x4E0A;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;
&#x90A3;&#x4E48;&#x51FD;&#x6570;&#x7F16;&#x7A0B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;
&#x6211;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x628A;&#x51FD;&#x6570;&#x770B;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x5143;&#x7D20;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x4ED6;&#x7EE7;&#x627F;&#x81EA;&#x62BD;&#x8C61;&#x5143;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x6B8A;&#x5C5E;&#x6027;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x6E32;&#x67D3;&#x65B9;&#x5F0F;&#x3002;&#x793A;&#x4F8B;&#x5982;&#x4E0B;:
<img src="assets/intro5.png" alt="">
&#x5B9E;&#x73B0;&#x4E0A;&#x9762;&#x6240;&#x6709;&#x60F3;&#x6CD5;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x5668;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x65E0;&#x975E;&#x90FD;&#x662F;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x4E0E;&#x5904;&#x7406;&#x3002;</p>
<p>c.&#x4EE3;&#x7801;&#x95EE;&#x9898;
&#x5176;&#x5B9E;&#x795E;&#x5668;&#x7684;&#x4EA7;&#x751F;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4EE3;&#x7801;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x5668;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x4E8E;&#x5143;&#x7D20;&#x7684;&#x7F16;&#x8F91;&#xFF0C;&#x90A3;&#x4E48;&#x4EE3;&#x7801;&#x65E0;&#x975E;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x6E32;&#x67D3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x5176;&#x5B9E;&#x7C7B;&#x4F3C;&#x4E8E;webpack&#x6253;&#x5305;&#xFF0C;&#x6211;&#x5148;&#x91C7;&#x7528;&#x5404;&#x79CD;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x51FA;&#x6240;&#x6709;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x7136;&#x540E;&#x6E32;&#x67D3;&#x5C55;&#x793A;&#x51FA;&#x9875;&#x9762;&#x6548;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x5C31;&#x5BFC;&#x51FA;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E00;&#x5207;&#x6570;&#x636E;&#x90FD;&#x5728;&#x6211;&#x638C;&#x63E1;&#x4E4B;&#x4E2D;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5BFC;&#x51FA;js&#x903B;&#x8F91;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5BFC;&#x51FA;&#x6E32;&#x67D3;&#x540E;&#x7684;css&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x5BFC;&#x51FA;&#x9009;&#x7136;&#x540E;&#x7684;html&#x7ED3;&#x6784;&#x3002;
&#x6211;&#x5728;&#x4EE3;&#x7801;&#x5BFC;&#x51FA;&#x8FD9;&#x5757;&#x6839;&#x636E;&#x6559;&#x80B2;&#x4EA7;&#x54C1;&#x90E8;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5B9E;&#x8DF5;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;FTL&#x548C;NEJ+Regular&#x7684;&#x6A21;&#x677F;&#xFF0C;&#x5BFC;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6A21;&#x677F;&#x76F4;&#x63A5;&#x5BFC;&#x51FA;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;
&#x5BFC;&#x51FA;&#x7684;&#x5B9E;&#x73B0;&#x903B;&#x8F91;&#x5982;&#x4E0B;&#xFF1A;
<img src="assets/intro6.png" alt="">
d. &#x795E;&#x5668;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x524D;&#x7AEF;&#x8F85;&#x52A9;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x901A;&#x8FC7;&#x7ED3;&#x5408;&#x5DE5;&#x5177;&#x7684;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x80FD;&#x6539;&#x53D8;&#x4F60;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7801;&#x601D;&#x60F3;&#xFF0C;&#x4ECE;&#x7F16;&#x8F91;&#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x5230;&#x8BBE;&#x8BA1;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x5BF9;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x95E8;&#x69DB;&#x8981;&#x6C42;&#x6BD4;&#x8F83;&#x4F4E;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x903B;&#x8F91;&#x7684;&#x95E8;&#x69DB;&#x8981;&#x6C42;&#x9AD8;&#x4E00;&#x4E9B;&#xFF0C;&#x4EA4;&#x4E92;&#x548C;&#x89C6;&#x89C9;&#x540C;&#x4E8B;&#x53EA;&#x8981;&#x7ECF;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8FD9;&#x4E2A;&#x795E;&#x5668;&#x6765;&#x5236;&#x4F5C;&#x89C6;&#x89C9;&#x7A3F;&#x548C;&#x4EA4;&#x4E92;&#x7A3F;&#x3002;&#x8FD9;&#x79CD;&#x8F93;&#x51FA;&#x5230;&#x5F00;&#x53D1;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#x3002;
PS: &#x795E;&#x5668;&#x4E2D;&#x751A;&#x81F3;&#x8FD8;&#x5B9E;&#x73B0;&#x4E86;&#x5E38;&#x89C1;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x70B9;&#x51FB;&#x5C31;&#x80FD;&#x5236;&#x4F5C;&#x4EE5;&#x53CA;&#x9884;&#x89C8;&#x52A8;&#x753B;&#x6548;&#x679C;&#x3002;
<img src="assets/intro7.png" alt=""></p>
<ol>
<li>&#x6700;&#x540E;&#xFF0C;&#x795E;&#x5668;&#x6765;&#x4E86;
&#x7ECF;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x5F00;&#x53D1;&#x5B9E;&#x8DF5;&#xFF0C;&#x7EC8;&#x4E8E;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x8F85;&#x52A9;&#x5F00;&#x53D1;&#x5DE5;&#x5177;-CMP &#xFF08;core mapping pages&#xFF09;&#x3002;&#x53D6;&#x540D;&#x5B57;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;CMS&#x8033;&#x719F;&#x80FD;&#x8BE6;&#xFF0C;&#x5176;&#x5B9E;CMP&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x4E00;&#x6B3E;&#x795E;&#x5668;&#x3002;&#x4ED6;&#x7684;&#x4E3B;&#x8981;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x6211;&#x5728;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x8BE6;&#x8FF0;&#x8FC7;&#x4E86;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x591A;&#x591A;&#x62CD;&#x7816;&#xFF01;&#xFF08;&#x76EE;&#x524D;&#x5C0F;&#x90E8;&#x5206;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x8FD8;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C; &#x671F;&#x5F85;&#x4E00;&#x4E0B;&#x795E;&#x5668;1.0&#x5427;</li>
</ol>
<p>&#xFF09;</p>
<p>&#x5B98;&#x65B9;&#x4E3B;&#x9875;&#xFF1A;<a href="https://chalecao.github.io/cmp_manual/" target="_blank">https://chalecao.github.io/cmp_manual/</a></p>
<p>&#x5728;&#x7EBF;&#x5C1D;&#x9C9C;&#x8BD5;&#x7528;&#x5730;&#x5740;&#xFF1A; <a href="https://chalecao.github.io/cmp/static/#/" target="_blank">https://chalecao.github.io/cmp/static/#/</a></p>
<p>&#x4F7F;&#x7528;&#x624B;&#x518C;&#xFF1A; <a href="https://chalecao.github.io/cmp_manual/book/index.html" target="_blank">https://chalecao.github.io/cmp_manual/book/index.html</a>
(PS: &#x5EFA;&#x8BAE;&#x76F4;&#x63A5;&#x8BD5;&#x7528;&#x7EC4;&#x4EF6;&#x6C60;&#x529F;&#x80FD; &#xFF0C;&#x76EE;&#x524D;&#x4E0D;&#x662F;&#x5F88;&#x7A33;&#x5B9A;&#xFF0C;&#x8FD8;&#x5728;&#x5B8C;&#x5584;&#x4E2D;)
<img src="assets/intro8.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="think.html" class="navigation navigation-next navigation-unique" aria-label="Next page: CMP使用手册">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"CMP设计思想","level":"1.1","depth":1,"next":{"title":"CMP使用手册","level":"1.2","depth":1,"path":"think.md","ref":"think.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2017-01-18T01:56:49.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-18T02:02:08.656Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

